app/views/shared/_sidenav.html.erb


    <div id="CourseCollapse" class="panel-collapse collapse <%= "in" if ["courses"].include?(params[:controller]) %>">
---
SELECT "courses".* FROM "courses"

                      sum=0
                      for course in (Course.all-current_user.courses)
---
SELECT "courses".* FROM "courses" INNER JOIN "grades" ON "courses"."id" = "grades"."course_id" WHERE "grades"."user_id" = $1  [["user_id", 36]]