app/controllers/courses_controller.rb

  def select
    @course=Course.find_by_id(params[:id])
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 12]]

  def list
    @course=Course.all
    @course=@course-current_user.courses
<<<<<<< HEAD

=======
    #添加是否开课
    openedcourses=[]
    @course.each do
---
SELECT "courses".* FROM "courses"
SELECT "courses".* FROM "courses" INNER JOIN "grades" ON "courses"."id" = "grades"."course_id" WHERE "grades"."user_id" = $1  [["user_id", 36]]

      if flag1==false and flag2==true

        @course.student_num += 1
        @course.save
---
UPDATE "courses" SET "student_num" = $1, "updated_at" = $2 WHERE "courses"."id" = $3  [["student_num", 1], ["updated_at", "2016-10-30 14:48:46.836420"], ["id", 1]]

  def quit
    @course=Course.find_by_id(params[:id])
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 9]]